Repository: Codecmb/django-vaishnava-study
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Vaishnava Study App
es: Aplicación de Estudio Vaishnava

source: Home
es: Inicio

source: Courses
es: Cursos

source: All Courses
es: Todos los Cursos

source: Upload
es: Subir

source: Upload Q&A
es: Subir P&R

source: Upload Study Materials
es: Subir Materiales de Estudio

source: Read in English
es: Leer en Inglés

source: Read in Spanish
es: Leer en Español

source: Q&A Section
es: Sección de P&R

source: Back to Home
es: Volver al Inicio

source: Back to Course
es: Volver al Curso

source: Books in this Course
es: Libros en este Curso

source: No books available for this course yet.
es: Aún no hay libros disponibles para este curso.

source: Please check back later or contact the course coordinator.
es: Por favor, vuelva más tarde o contacte al coordinador del curso.

source: About This Book
es: Acerca de este Libro

source: This book is part of the
es: Este libro es parte del

source: course. Use the links above to read the book online or access the Q&A section for study questions.
es: curso. Use los enlaces de arriba para leer el libro en línea o acceder a la sección de P&R para preguntas de estudio.

source: Study Materials for
es: Materiales de Estudio para

source: Upload Q&A CSV
es: Subir CSV de P&R

source: English
es: Inglés

source: Spanish
es: Español

source: Both Languages
es: Ambos Idiomas

source: Questions & Answers
es: Preguntas y Respuestas

source: No study materials available yet for this book.
es: Aún no hay materiales de estudio disponibles para este libro.

source: Use the upload buttons above to add study materials.
es: Use los botones de subir arriba para agregar materiales de estudio.

source: Delete this material
es: Eliminar este material

source: Comprehensive spiritual education platform
es: Plataforma integral de educación espiritual

source: Available Courses
es: Cursos Disponibles

source: Explore Course
es: Explorar Curso

source: No courses available yet.
es: Aún no hay cursos disponibles.

source: Please check back later or contact the administrator.
es: Por favor, vuelva más tarde o contacte al administrador.

source: Reference Websites
es: Sitios Web de Referencia

source: All reference websites available in both English and Spanish
es: Todos los sitios web de referencia disponibles en inglés y español

source: © 2024 Vaishnava Study App. All rights reserved.
es: © 2024 Aplicación de Estudio Vaishnava. Todos los derechos reservados.
